In [3]:
import pandas as pd
import numpy as np

# Pandas Data Structure

In [4]:
# Series
# Creating from list , dict, np
# Indexing
# Basic Oops
# Data Frames
# Creating
# Indexing
# Basic Oops

# Series

In [6]:
a = [1,2,3,4,5,6]
type(a)

list

In [10]:
series_a = pd.Series(a)
series_a

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [11]:
d1 = {"a":10,"b":20,"c":30,"d":40}
d1

{'a': 10, 'b': 20, 'c': 30, 'd': 40}

In [15]:
series_d1 = pd.Series(d1)
series_d1

a    10
b    20
c    30
d    40
dtype: int64

In [17]:
arr = np.array([1,2,3,4,5])
arr

array([1, 2, 3, 4, 5])

In [18]:
series_arr = pd.Series(arr)
series_arr

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [19]:
data = pd.Series([18,17,19,12,8],index=["ali","asad","ahmad","usman","hassan"])
data

ali       18
asad      17
ahmad     19
usman     12
hassan     8
dtype: int64

# Indexing

In [20]:
s1 = pd.Series([10,20,30,40],index=["a","b","c","d"])
s1

a    10
b    20
c    30
d    40
dtype: int64

In [21]:
s1[0]

10

In [23]:
s1[0:2]

a    10
b    20
dtype: int64

In [24]:
s1["a"]

10

In [27]:
s1[["a","d"]]

a    10
d    40
dtype: int64

In [28]:
s1

a    10
b    20
c    30
d    40
dtype: int64

In [30]:
s1[s1>20]

c    30
d    40
dtype: int64

In [31]:
s1>20

a    False
b    False
c     True
d     True
dtype: bool

In [32]:
indices = ["a","c","d"]
s1[indices]

a    10
c    30
d    40
dtype: int64

In [36]:
s1 = pd.Series([1,2,3,4],index=["a","b","c","e"])
s2 = pd.Series([10,20,30,40],index=["a","b","c","d"])

In [37]:
s1

a    1
b    2
c    3
e    4
dtype: int64

In [38]:
s2

a    10
b    20
c    30
d    40
dtype: int64

In [39]:
s1+s2

a    11.0
b    22.0
c    33.0
d     NaN
e     NaN
dtype: float64

In [40]:
s1-s2

a    -9.0
b   -18.0
c   -27.0
d     NaN
e     NaN
dtype: float64

In [41]:
s1*s2

a    10.0
b    40.0
c    90.0
d     NaN
e     NaN
dtype: float64

In [42]:
s1/s2

a    0.1
b    0.1
c    0.1
d    NaN
e    NaN
dtype: float64

In [43]:
# unary operation
np.sqrt(s1)

a    1.000000
b    1.414214
c    1.732051
e    2.000000
dtype: float64

In [44]:
np.exp(s1)

a     2.718282
b     7.389056
c    20.085537
e    54.598150
dtype: float64

In [46]:
np.log(s2)

a    2.302585
b    2.995732
c    3.401197
d    3.688879
dtype: float64

In [47]:
s1.sum()

10

In [49]:
np.sum(s2)

100

In [50]:
s1.mean()

2.5

In [51]:
np.max(s1)

4

In [52]:
s1.min()

1

In [56]:
s1 = pd.Series([1,2,3,4],index=["a","b","c","d"])
s2 = pd.Series([10,20,30,40],index=["a","b","c","d"])

In [57]:
s1>s2

a    False
b    False
c    False
d    False
dtype: bool

In [58]:
s1<=(s2/10)

a    True
b    True
c    True
d    True
dtype: bool

In [59]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [61]:
s1["c"] = 5

In [62]:
s1

a    1
b    2
c    5
d    4
dtype: int64

In [63]:
s1["e"] = -2

In [64]:
s1

a    1
b    2
c    5
d    4
e   -2
dtype: int64

# DataFrames

In [65]:
data = {"name":["asad","ashar","awais","diyan"],
       "age":[23,120,88,11],
       "city":["DGK","BWP","Lodhran","Pakpatan"]}
data

{'name': ['asad', 'ashar', 'awais', 'diyan'],
 'age': [23, 120, 88, 11],
 'city': ['DGK', 'BWP', 'Lodhran', 'Pakpatan']}

In [66]:
df = pd.DataFrame(data)
df

    name  age      city
0   asad   23       DGK
1  ashar  120       BWP
2  awais   88   Lodhran
3  diyan   11  Pakpatan

In [71]:
data2 = [["asad","ashar","awais","diyan"],[20,120,88,11],["DGK","BWP","Lodhran","Pakpatan"]]
df2 = pd.DataFrame(data2,columns=["as","Name","age","City"])
df2

     as   Name      age      City
0  asad  ashar    awais     diyan
1    20    120       88        11
2   DGK    BWP  Lodhran  Pakpatan

In [72]:
a = [["asad",20,"Lodhran"],["awais",10,"Bwp"]]
df3 = pd.DataFrame(a,columns=["Name","Age","City"])
df3

    Name  Age     City
0   asad   20  Lodhran
1  awais   10      Bwp

In [74]:
# Empty Dataframe
df4 = pd.DataFrame(columns=["Name","Age","City"])
df4

Empty DataFrame
Columns: [Name, Age, City]
Index: []

In [75]:
df

    name  age      city
0   asad   23       DGK
1  ashar  120       BWP
2  awais   88   Lodhran
3  diyan   11  Pakpatan

In [77]:
df["name"]

0     asad
1    ashar
2    awais
3    diyan
Name: name, dtype: object

In [78]:
df[["name","city"]]

    name      city
0   asad       DGK
1  ashar       BWP
2  awais   Lodhran
3  diyan  Pakpatan

In [80]:
df["marks"] = [10,20,30,40]
df

    name  age      city  marks
0   asad   23       DGK     10
1  ashar  120       BWP     20
2  awais   88   Lodhran     30
3  diyan   11  Pakpatan     40

In [82]:
df.drop("marks",axis=1)

    name  age      city
0   asad   23       DGK
1  ashar  120       BWP
2  awais   88   Lodhran
3  diyan   11  Pakpatan

In [88]:
df.iloc[1,2]

'BWP'

In [90]:
df.loc[1]

name     ashar
age        120
city       BWP
marks       20
Name: 1, dtype: object

In [91]:
df

    name  age      city  marks
0   asad   23       DGK     10
1  ashar  120       BWP     20
2  awais   88   Lodhran     30
3  diyan   11  Pakpatan     40

In [93]:
df[df["age"]>20]

    name  age     city  marks
0   asad   23      DGK     10
1  ashar  120      BWP     20
2  awais   88  Lodhran     30

In [95]:
df.at[1,"name"]

'ashar'

In [96]:
df.at[0,"age"]

23

In [97]:
df

    name  age      city  marks
0   asad   23       DGK     10
1  ashar  120       BWP     20
2  awais   88   Lodhran     30
3  diyan   11  Pakpatan     40

In [99]:
df5 = df.set_index("name")
df5

       age      city  marks
name
asad    23       DGK     10
ashar  120       BWP     20
awais   88   Lodhran     30
diyan   11  Pakpatan     40

In [100]:
df5.reset_index()

    name  age      city  marks
0   asad   23       DGK     10
1  ashar  120       BWP     20
2  awais   88   Lodhran     30
3  diyan   11  Pakpatan     40

In [101]:
df.head(2)

    name  age city  marks
0   asad   23  DGK     10
1  ashar  120  BWP     20

In [102]:
df.tail(2)

    name  age      city  marks
2  awais   88   Lodhran     30
3  diyan   11  Pakpatan     40

In [104]:
df.describe()

              age      marks
count    4.000000   4.000000
mean    60.500000  25.000000
std     52.131245  12.909944
min     11.000000  10.000000
25%     20.000000  17.500000
50%     55.500000  25.000000
75%     96.000000  32.500000
max    120.000000  40.000000

In [105]:
df.T

          0      1        2         3
name   asad  ashar    awais     diyan
age      23    120       88        11
city    DGK    BWP  Lodhran  Pakpatan
marks    10     20       30        40

In [106]:
df

    name  age      city  marks
0   asad   23       DGK     10
1  ashar  120       BWP     20
2  awais   88   Lodhran     30
3  diyan   11  Pakpatan     40

In [107]:
df.sort_values(by="age")

    name  age      city  marks
3  diyan   11  Pakpatan     40
0   asad   23       DGK     10
2  awais   88   Lodhran     30
1  ashar  120       BWP     20

In [110]:
df.sort_values(by="marks",ascending=False)

    name  age      city  marks
3  diyan   11  Pakpatan     40
2  awais   88   Lodhran     30
1  ashar  120       BWP     20
0   asad   23       DGK     10

In [111]:
df[df["marks"]>13]

    name  age      city  marks
1  ashar  120       BWP     20
2  awais   88   Lodhran     30
3  diyan   11  Pakpatan     40

In [112]:
df

    name  age      city  marks
0   asad   23       DGK     10
1  ashar  120       BWP     20
2  awais   88   Lodhran     30
3  diyan   11  Pakpatan     40

In [113]:
df.groupby("city")

In [114]:
df.groupby("marks")

In [116]:
df.groupby("marks").mean()

         age
marks
10      23.0
20     120.0
30      88.0
40      11.0